spec/equifax_credit/CE_Req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://vedaxml.com/vxml2/company-enquiry-v3-2.xsd" xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <soapenv:Header>
      <wsse:Security mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>abc</wsse:Username>
            <wsse:Password>xyz</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
      <wsa:MessageID>urn:example.com:123456789</wsa:MessageID>
      <wsa:To>https://vedaxml.com/sys2/company-enquiry-v3-2</wsa:To>
      <wsa:Action>http://vedaxml.com/companyEnquiry/ServiceRequest</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <com:request client-reference="CR-001" reason-for-enquiry="REASON" enquiry-id="ENQUIRY-ID" request-type="REPORT">
         <!--You have a CHOICE of the next 2 items at this level-->
         <!--Optional:-->
         <com:bureau-reference>BFN 001</com:bureau-reference>
         <!--1 or more repetitions:-->
         <com:subject role="principal">
            <com:australian-company-number>000105233</com:australian-company-number>
            <!--0 to 20 repetitions:-->
         </com:subject>
         <com:current-historic-flag>current-and-historical</com:current-historic-flag>
         <com:enquiry type="credit-review">
            <com:account-type code="30">DAYACCOUNT30</com:account-type>
            <com:enquiry-amount currency-code="AUD">100</com:enquiry-amount>
            <!--Optional:-->
            <com:co-borrower/>
            <!--Optional:-->
            <com:client-reference>REF21</com:client-reference>
         </com:enquiry>
         <com:collateral-information>
            <com:credit-type>COMMERCIAL</com:credit-type>
            <!--Optional:-->
            <com:link-limit>100</com:link-limit>
            <com:scoring-required>yes</com:scoring-required>
            <!--Optional:-->
            <com:enrichment-required>yes</com:enrichment-required>
            <!--Optional:-->
            <com:ppsr-required>yes</com:ppsr-required>
         </com:collateral-information>
      </com:request>
   </soapenv:Body>
</soapenv:Envelope>